results/test17_mixed_workload/fio-t17-256k-3.log
Starting FIO benchmark on pod 3...
FIO Configuration:
[global]
ioengine=libaio
direct=1
size=20G
runtime=900
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

[test17-mixed-256k]
rw=randrw
rwmixread=50
bs=256k
# 2,000 IOPS per pod / 8 threads = 250 IOPS per thread
rate_iops=250
---
test17-mixed-256k: (g=0): rw=randrw, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
test17-mixed-256k: Laying out IO file (1 file / 20480MiB)
test17-mixed-256k: Laying out IO file (1 file / 20480MiB)
test17-mixed-256k: Laying out IO file (1 file / 20480MiB)
[...]

test17-mixed-256k: (groupid=0, jobs=8): err= 0: pid=79: Thu Sep  3 17:53:50 2026
  read: IOPS=1999, BW=500MiB/s (524MB/s)(439GiB/900002msec)
    slat (usec): min=10, max=10316, avg=24.67, stdev=14.03
    clat (usec): min=95, max=311452, avg=2432.79, stdev=3040.35
     lat (usec): min=490, max=311471, avg=2457.46, stdev=3040.33
    clat percentiles (usec):
     |  1.00th=[  668],  5.00th=[  906], 10.00th=[ 1270], 20.00th=[ 1500],
     | 30.00th=[ 1631], 40.00th=[ 1745], 50.00th=[ 1876], 60.00th=[ 2024],
     | 70.00th=[ 2245], 80.00th=[ 2606], 90.00th=[ 3490], 95.00th=[ 4883],
     | 99.00th=[14222], 99.50th=[22414], 99.90th=[37487], 99.95th=[46400],
     | 99.99th=[66323]
   bw (  KiB/s): min=366592, max=656896, per=100.00%, avg=512112.75, stdev=1253.19, samples=14392
   iops        : min= 1432, max= 2566, avg=2000.30, stdev= 4.90, samples=14392
  write: IOPS=1999, BW=500MiB/s (524MB/s)(439GiB/900002msec); 0 zone resets
    slat (usec): min=15, max=1153, avg=43.62, stdev=15.50
    clat (usec): min=692, max=309208, avg=1687.76, stdev=2632.71
     lat (usec): min=796, max=309259, avg=1731.38, stdev=2632.81
    clat percentiles (usec):
     |  1.00th=[  922],  5.00th=[  971], 10.00th=[ 1004], 20.00th=[ 1057],
     | 30.00th=[ 1106], 40.00th=[ 1156], 50.00th=[ 1237], 60.00th=[ 1319],
     | 70.00th=[ 1434], 80.00th=[ 1647], 90.00th=[ 2147], 95.00th=[ 3163],
     | 99.00th=[10945], 99.50th=[18220], 99.90th=[32113], 99.95th=[40109],
     | 99.99th=[63177]
   bw (  KiB/s): min=369664, max=653824, per=100.00%, avg=512113.36, stdev=1204.66, samples=14392
   iops        : min= 1444, max= 2554, avg=2000.30, stdev= 4.71, samples=14392
  lat (usec)   : 100=0.01%, 500=0.01%, 750=1.09%, 1000=6.61%
  lat (msec)   : 2=65.51%, 4=21.38%, 10=4.06%, 20=0.84%, 50=0.49%
  lat (msec)   : 100=0.03%, 250=0.01%, 500=0.01%
  cpu          : usr=0.70%, sys=1.43%, ctx=5228173, majf=0, minf=10285
  IO depths    : 1=45.7%, 2=48.1%, 4=3.8%, 8=1.4%, 16=0.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1800000,1800000,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=500MiB/s (524MB/s), 500MiB/s-500MiB/s (524MB/s-524MB/s), io=439GiB (472GB), run=900002-900002msec
  WRITE: bw=500MiB/s (524MB/s), 500MiB/s-500MiB/s (524MB/s-524MB/s), io=439GiB (472GB), run=900002-900002msec
FIO benchmark completed on pod 3