results/test17_mixed_workload/fio-t17-32k-1.log
Starting FIO benchmark on pod 1...
FIO Configuration:
[global]
ioengine=libaio
direct=1
size=10G
runtime=900
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=32

[test17-mixed-32k]
rw=randrw
rwmixread=50
bs=32k
# 2,000 IOPS per pod / 8 threads = 250 IOPS per thread
rate_iops=250
---
test17-mixed-32k: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
...
fio-3.41
Starting 8 processes
test17-mixed-32k: Laying out IO file (1 file / 10240MiB)
test17-mixed-32k: Laying out IO file (1 file / 10240MiB)
test17-mixed-32k: Laying out IO file (1 file / 10240MiB)
[...]

test17-mixed-32k: (groupid=0, jobs=8): err= 0: pid=79: Thu Sep  3 17:50:23 2026
  read: IOPS=1999, BW=62.5MiB/s (65.5MB/s)(54.9GiB/900001msec)
    slat (usec): min=2, max=1909, avg= 9.30, stdev= 7.32
    clat (usec): min=13, max=233164, avg=807.29, stdev=2308.48
     lat (usec): min=151, max=233182, avg=816.59, stdev=2308.38
    clat percentiles (usec):
     |  1.00th=[  217],  5.00th=[  293], 10.00th=[  392], 20.00th=[  453],
     | 30.00th=[  494], 40.00th=[  537], 50.00th=[  578], 60.00th=[  627],
     | 70.00th=[  693], 80.00th=[  791], 90.00th=[  996], 95.00th=[ 1270],
     | 99.00th=[ 4948], 99.50th=[ 9241], 99.90th=[33162], 99.95th=[52691],
     | 99.99th=[88605]
   bw (  KiB/s): min=43968, max=80960, per=100.00%, avg=64010.46, stdev=120.80, samples=14392
   iops        : min= 1374, max= 2530, avg=2000.22, stdev= 3.78, samples=14392
  write: IOPS=1999, BW=62.5MiB/s (65.5MB/s)(54.9GiB/900001msec); 0 zone resets
    slat (usec): min=3, max=564, avg=11.86, stdev= 7.79
    clat (nsec): min=1958, max=230604k, avg=515103.13, stdev=944629.92
     lat (usec): min=223, max=230613, avg=526.97, stdev=944.64
    clat percentiles (usec):
     |  1.00th=[  273],  5.00th=[  297], 10.00th=[  314], 20.00th=[  334],
     | 30.00th=[  355], 40.00th=[  375], 50.00th=[  400], 60.00th=[  433],
     | 70.00th=[  474], 80.00th=[  537], 90.00th=[  652], 95.00th=[  807],
     | 99.00th=[ 2245], 99.50th=[ 5014], 99.90th=[16057], 99.95th=[19006],
     | 99.99th=[26870]
   bw (  KiB/s): min=48640, max=79232, per=100.00%, avg=64010.41, stdev=99.55, samples=14392
   iops        : min= 1520, max= 2476, avg=2000.22, stdev= 3.12, samples=14392
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=1.48%
  lat (usec)   : 500=51.89%, 750=31.59%, 1000=8.72%
  lat (msec)   : 2=4.69%, 4=0.71%, 10=0.61%, 20=0.20%, 50=0.08%
  lat (msec)   : 100=0.03%, 250=0.01%
  cpu          : usr=0.29%, sys=0.65%, ctx=5343195, majf=0, minf=1498
  IO depths    : 1=49.3%, 2=49.6%, 4=0.6%, 8=0.3%, 16=0.1%, 32=0.1%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1800000,1800000,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=62.5MiB/s (65.5MB/s), 62.5MiB/s-62.5MiB/s (65.5MB/s-65.5MB/s), io=54.9GiB (59.0GB), run=900001-900001msec
  WRITE: bw=62.5MiB/s (65.5MB/s), 62.5MiB/s-62.5MiB/s (65.5MB/s-65.5MB/s), io=54.9GiB (59.0GB), run=900001-900001msec
FIO benchmark completed on pod 1