results/test17_mixed_workload/fio-t17-64k-8.log
Starting FIO benchmark on pod 8...
FIO Configuration:
[global]
ioengine=libaio
direct=1
size=10G
runtime=900
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

[test17-mixed-64k]
rw=randrw
rwmixread=50
bs=64k
# 2,000 IOPS per pod / 8 threads = 250 IOPS per thread
rate_iops=250
---
test17-mixed-64k: (g=0): rw=randrw, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
test17-mixed-64k: Laying out IO file (1 file / 10240MiB)
test17-mixed-64k: Laying out IO file (1 file / 10240MiB)
test17-mixed-64k: Laying out IO file (1 file / 10240MiB)
[...]

test17-mixed-64k: (groupid=0, jobs=8): err= 0: pid=79: Thu Sep  3 17:51:55 2026
  read: IOPS=1999, BW=125MiB/s (131MB/s)(110GiB/900003msec)
    slat (usec): min=4, max=661, avg=12.27, stdev=10.97
    clat (usec): min=2, max=430504, avg=1783.18, stdev=3501.70
     lat (usec): min=280, max=430516, avg=1795.45, stdev=3501.47
    clat percentiles (usec):
     |  1.00th=[  445],  5.00th=[  644], 10.00th=[  725], 20.00th=[  824],
     | 30.00th=[  906], 40.00th=[  988], 50.00th=[ 1074], 60.00th=[ 1205],
     | 70.00th=[ 1369], 80.00th=[ 1647], 90.00th=[ 2802], 95.00th=[ 5276],
     | 99.00th=[13698], 99.50th=[20841], 99.90th=[43254], 99.95th=[53216],
     | 99.99th=[73925]
   bw (  KiB/s): min=68992, max=188672, per=100.00%, avg=128024.01, stdev=524.58, samples=14392
   iops        : min= 1078, max= 2948, avg=2000.37, stdev= 8.20, samples=14392
  write: IOPS=1999, BW=125MiB/s (131MB/s)(110GiB/900003msec); 0 zone resets
    slat (usec): min=6, max=1108, avg=17.30, stdev=12.70
    clat (usec): min=19, max=465335, avg=1423.41, stdev=3066.16
     lat (usec): min=368, max=465349, avg=1440.71, stdev=3065.93
    clat percentiles (usec):
     |  1.00th=[  453],  5.00th=[  502], 10.00th=[  537], 20.00th=[  594],
     | 30.00th=[  652], 40.00th=[  709], 50.00th=[  783], 60.00th=[  873],
     | 70.00th=[ 1012], 80.00th=[ 1270], 90.00th=[ 2343], 95.00th=[ 4686],
     | 99.00th=[11469], 99.50th=[17695], 99.90th=[36439], 99.95th=[45876],
     | 99.99th=[71828]
   bw (  KiB/s): min=68480, max=190336, per=100.00%, avg=128024.01, stdev=519.30, samples=14392
   iops        : min= 1070, max= 2974, avg=2000.37, stdev= 8.11, samples=14392
  lat (usec)   : 4=0.01%, 20=0.01%, 250=0.01%, 500=3.31%, 750=25.70%
  lat (usec)   : 1000=26.34%
  lat (msec)   : 2=31.95%, 4=5.70%, 10=5.58%, 20=0.98%, 50=0.41%
  lat (msec)   : 100=0.05%, 250=0.01%, 500=0.01%
  cpu          : usr=0.35%, sys=0.79%, ctx=5251560, majf=0, minf=1211
  IO depths    : 1=46.7%, 2=48.6%, 4=3.1%, 8=0.7%, 16=0.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1800000,1800000,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=125MiB/s (131MB/s), 125MiB/s-125MiB/s (131MB/s-131MB/s), io=110GiB (118GB), run=900003-900003msec
  WRITE: bw=125MiB/s (131MB/s), 125MiB/s-125MiB/s (131MB/s-131MB/s), io=110GiB (118GB), run=900003-900003msec
FIO benchmark completed on pod 8